[
  {
    "path": "posts/2021-07-05-assignment/",
    "title": "Assignment",
    "description": "This post is built for Assignment of ISSS608 Visual Analytics and Application.",
    "author": [
      {
        "name": "LI Yuhong",
        "url": {}
      }
    ],
    "date": "2021-07-05",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Overview\r\n1.1 Background\r\n1.2 Objective\r\n\r\n2. Literature Review\r\n3. Installation and load of R packages\r\n4. Data Preparation\r\n4.1 Data Import and View\r\n4.2 Data Wrangling\r\n4.3 Data Extraction\r\n4.4 Final Data\r\n\r\n5. Data Visualisation and Analysis\r\n5.1\r\n\r\n6. Conclusion\r\n\r\n\r\npre {\r\n  max-height: 1000px;\r\n  max-width: 30px;\r\n  overflow-y: scroll;\r\n  overflow_x: scroll;\r\n}\r\n\r\npre[class] {\r\n  max-height: 1000px;\r\n  max-width: 30px;\r\n  overflow-y: scroll;\r\n  overflow_x: scroll;\r\n}\r\n\r\npre {\r\n  max-height: 1000px;\r\n  max-width: 30px;\r\n  overflow-y: scroll;\r\n  overflow_x: scroll;\r\n}\r\n\r\npre[class] {\r\n  max-height: 1000px;\r\n  max-width: 30px;\r\n  overflow-y: scroll;\r\n  overflow_x: scroll;\r\n}\r\n\r\n1. Overview\r\n1.1 Background\r\nThis assignment topic is based on Mini-Challenge 2 of VAST Challenge 2021, and there is background introduction of VAST Challenge 2021.\r\nIn the roughly twenty years that Tethys-based GAStech has been operating a natural gas production site in the island country of Kronos, it has produced remarkable profits and developed strong relationships with the government of Kronos. However, GAStech has not been as successful in demonstrating environmental stewardship.\r\nIn January, 2014, the leaders of GAStech are celebrating their new-found fortune as a result of the initial public offering of their very successful company. In the midst of this celebration, several employees of GAStech go missing. An organization known as the Protectors of Kronos (POK) is suspected in the disappearance, but things may not be what they seem.\r\n1.2 Objective\r\nThe data used in this research is the movement and tracking data of employees. GAStech provides many of their employees with company cars for their personal and professional use, but unbeknownst to the employees, the cars are equipped with GPS tracking devices.\r\nBased on the given tracking data for the two weeks leading up to the disappearance, as well as credit card transactions and loyalty card usage data, we aim to use appropriate visually driven data analysis techniques to complete two objectives:\r\nIdentify anomalies and suspicious behaviors of employees.\r\nIdentify the owners of each credit and loyalty card .\r\n2. Literature Review\r\n3. Installation and load of R packages\r\nPackages “tidyverse”, “tidyr”, “tidyverse” and“dplyr” will be used to clean and wrangle data for final visualization.\r\nPackages “sp”, “raster”, “sf”, “vctrs”, “clock”, “tmap”, “rgdal”, “readr” and “ggplot2” will be used for making visualization.\r\nThe code chunks below are used to install and load the packages in R.\r\n\r\n\r\npackages = c(\"tidyverse\",\"tidyr\",\"tidyverse\",\"dplyr\",\"sp\",\"raster\",\"sf\",\r\n             \"vctrs\",\"clock\",\"tmap\",\"rgdal\",\"readr\",\"ggplot2\")\r\nfor (p in packages){\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n4. Data Preparation\r\n4.1 Data Import and View\r\nThe data was imported by using read.csv().\r\n\r\n\r\ncartrack <- read.csv(\"D:/SMU/Visual Analytics and Applications/Project and Assignment/Assignment/Challenge 2/MC2/car-assignments.csv\")\r\n\r\ncreditcard <- read.csv(\"D:/SMU/Visual Analytics and Applications/Project and Assignment/Assignment/Challenge 2/MC2/cc_data.csv\")\r\n\r\ngps <- read.csv(\"D:/SMU/Visual Analytics and Applications/Project and Assignment/Assignment/Challenge 2/MC2/gps.csv\")\r\n\r\nloyaltycard <- read.csv(\"D:/SMU/Visual Analytics and Applications/Project and Assignment/Assignment/Challenge 2/MC2/loyalty_data.csv\")\r\n\r\n\r\n\r\nView the data by the following coding.\r\n\r\n\r\nview(cartrack)\r\nview(creditcard)\r\nview(gps)\r\nview(loyaltycard)\r\n\r\n\r\n\r\nThe overview of data are shown in Table 1.\r\nTable 1\r\nS/N\r\nName of Data\r\nNumber of Observations\r\nVariables\r\n1\r\ncartrack\r\n44\r\nLastName, FirstName, CarID, CurrentEmploymentType, CurrentEmploymentTitle\r\n2\r\ncreditcard\r\n1490\r\ntimestamp, location, price, last4ccnum\r\n3\r\ngps\r\n685,169\r\nTimestamp, id, lat, long\r\n4\r\nloyaltycard\r\n1392\r\ntimestamp, location, price, loyaltynum\r\n4.2 Data Wrangling\r\n4.3 Data Extraction\r\n4.4 Final Data\r\n5. Data Visualisation and Analysis\r\n5.1\r\n6. Conclusion\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-07-07T21:46:40+08:00",
    "input_file": "assignment.knit.md"
  },
  {
    "path": "posts/2021-06-13-dataviz-makeover-2/",
    "title": "Dataviz Makeover 2",
    "description": "This post is built for DataViz Makeover 2 of ISSS608 Visual Analytics and    Application.",
    "author": [
      {
        "name": "LI Yuhong",
        "url": {}
      }
    ],
    "date": "2021-06-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n1.1 Data Source\r\n1.2 The Original Visualisation\r\n\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\n3.2 Advantages of Proposed Design\r\n\r\n4. Data Visualisation Steps\r\n4.1 Data Preparation\r\n4.2 Import and Pivot Data\r\n4.3 Data Visualisation\r\n4.4 Final Visualisation\r\n\r\n5. Main Observations\r\n\r\n1. Introduction\r\n1.1 Data Source\r\nThe data visualisations, including the original one and the redesigned one, were created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market and are compiled by the Enterprise Singapore.\r\n1.2 The Original Visualisation\r\nThe original data visualisation that will be assessed was shown in the following figure. This visualization shows the merchandise trade, including export and import, between Singapore and top six trading countries during the period from January 2011 to December 2020.\r\nFigure 1\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nThere is not a title: The lack of a title prevents the readers from quickly understanding the purpose of the visualisation. There are two notes for describing the information of this graph, but the long description is not so direct as a concise title.\r\nAdd a concise title, like “Singapore’s Merchandise Trade Value with Ten Trading Partners, 2011-2020”.\r\n2\r\nThe lack of unit for x-axis and y-axis: There are a series of numbers in x-axis and y-axis to show the values of exports and imports respectively, but there is not a label to show the unit of x-axis and y-axis.\r\nAdd the unit label of SGD in billion, “S$(Billion)” for x-axis and y-axis.\r\n3\r\nThe positions of titles for x-axis and y-axis are misleading: Although the colors and icons can help readers to distinguish which axis is for import value and which axis is for export value, the unreasonable positions (at the beginning of each axis) of “Exports” and “Imports” for x-axis and y-axis are still very confusing.\r\nPut the titles in the middle position of each axis.\r\n4\r\nThere is not information about the study period: We can’t know the study period of this visualisation.\r\nAdd the period of “2011-2020” in the main title or add a note to show the period, “between January 2011-December 2020”.\r\n5\r\nIt is difficult to distinguish the import value and export value for each region: Because there are a large amount of overlap parts among some bubbles or some centre points were covered by the labels of total trade value, we can’t see all the centre points in the graph clearly. The hidden centre points prevent readers from knowing the import value and export value.\r\nMake the size of each bubble smaller to show all the cretre points and move the positions of some labels.\r\n6\r\nThe icons of “TOP NET EXPORTER” and “TOP NET IMPORTER” are confusing: When readers firstly see the icons of “TOP NET EXPORTER” and “TOP NET IMPORTER” in the graph, it is difficult for readers to know the meanings of the icons until they see the legends below. It is an indirect description.\r\nChange the icons in the graph to texts of “TOP NET EXPORTER” and “TOP NET IMPORTER” and then remove the legend below.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nThe unreasonable layouts of the graph, the legend and notes: The readers will be more easy to see the legend if the legend is closed to the graph part. However, positions of legends, “TOP NET EXPORTER” and “TOP NET IMPORTER”, are below the note in this graph, the position is abnormal.At the same time, the abnormal layout causes the whole visualisation chaotic.\r\nPut the legend on the left of the graph or above the note part.\r\n2\r\nToo large size of the bubbles: Because there are some overlap part of bubbles due to the too large size, we can not see all the bubbles completely. Too large bubbles do not only cause difficulties in transferring information of the graph, but also cause the mussy layout.\r\nMake the size of bubbles smaller.\r\n3\r\nToo many different fonts are used in this graph: There are three different fonts are used in the part of graph, note and information description respectively. The inconsistent fonts will cause the all visualisation no so beautiful and professional.\r\nUse the same font in the part of note and information description.\r\n4\r\nThe background color of information description part is too dark: The blue background color is more dark than other parts of this visualisation, so when readers see this visualisation, their attention will be caught by this part. The most important part, graph part, may not be focused on during readers’ first reading.\r\nRemove the background color of the information description part and change the font color to black as the font in note part.\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\nFigure 2\r\n3.2 Advantages of Proposed Design\r\nClear and interactive title: The main title “Merchandise Trade Change and Comparison of Trading Partners, 2011-2020” shows the purpose of the visulisation and subtitles provide interactive parts of “(Period)” which will change as the reader’s choice.\r\nSuitable size of the bubbles: Adjust the size of bubbles in order to decrease the overlap area and show the bubble of each trading partner clearly.\r\nSimple and clear layout: Delete the unnecessary part of the visualisation,like the information part at the bottom of the visualisation and adjust the layout of the visualisation.\r\nThe use of interactive techniques: Add interactive techniques to give the reader more freedom to read the images. For example, the readers can change the year and trading partners they want to know by using the function of filter.\r\n4. Data Visualisation Steps\r\n4.1 Data Preparation\r\nDownload the dataset from the website of Department of Statistics, Singapore(DOS), and then open the file by Excel.Delete the unnecessary sheet of “Content” and then rename the sheets of “T1” and “T2” as “Import” and “Export”.\r\nFigure 3\r\nSelect the useless rows from 1 to 5 and from 100 to 112 in sheets of both “Import” and “Export”, and then delete these selected rows.\r\nFigure 4\r\nSelect the columns that are not in the study period, and then delete them in sheets of both “Import” and “Export”.\r\nFigure 5\r\nWe will not use the data of continents and “Total Merchandise Imports”, so the rows from 2 to 8 were seleced and deleted.\r\nFigure 6\r\nAfter observing the values of dataset, we find that the unit for the dataset is “Thousand Dollars”, so we should adjust the value. Enter “1000” in any empty cell, and copy it. Select the value part , and then right click to choose “Paste Special”. Under the function of Operation, the “Multiply” choice was selected, and then we clicked “OK”. Do the same actions in both sheets, and clear the cell of “1000” after completing the above actions.\r\nFigure 7\r\nAll the “Thousand Dollars” were replaced by empty by the function of Replace.\r\nFigure 8\r\nAt last, save the file, “outputFile”.\r\n4.2 Import and Pivot Data\r\nImport the file of “outputFile” into Tableau. And drag “Import” into the pane.\r\nFigure 9\r\nSelect all the columns except the first column, and then right click to choose “Pivot”.\r\nFigure 10\r\nRename the pivoted columns to “Period” and “Imports” respectively, and change the data type of “Period” column to Date.\r\nFigure 11\r\nDo the similar actions in the sheet of “Export”, but rename the pivoted columns to “Period (Export)” and “Exports” respectively. Combine the sheet of “Import” and “Export” by the Region and Period value as figure 12.\r\nFigure 12\r\n4.3 Data Visualisation\r\nClick Analysis->Create Calculated Field, and then create a new variable of “Total Trade”. The formula of “Total Trade” is shown in the Figure 13.\r\nFigure 13\r\nDrag the variables as Figure 14. And change the chart type to Circle.\r\nFigure 14\r\nEdit the title of chart as Figure 15.\r\nFigure 15\r\nClick Analysis->Create Calculated Field, and then create a new variable of “Reference Line”. The formula of “Total Trade” is shown in the Figure 16.\r\nFigure 16\r\nDrag “Reference Line” to Rows.\r\nFigure 17\r\nChange the chart type to Line, and adjust the color opacity to 0. And then add the trend line by right click.\r\nFigure 18\r\nRight click the “Reference Line” to choose dual axis. And then we got the following result. Right click the axis of Reference Line and show header.\r\nFigure 19\r\nAdjust the Format of all the values as the following figures. The similar setting method will be used in other charts.\r\nFigure 20\r\nFigure 21\r\nAdd the Labels of countries and values.\r\nFigure 22\r\nCheck “Show history”. Rename the worksheet as “Bubble Chart”.\r\nFigure 23\r\nCreate a new worksheet and then drag the variables as Figure 24 and then change the size of the whole chart. Add highlighters under Analysis->Highlighters->Measure Name. Rename the worksheet as “Trade Value”.\r\nFigure 24\r\nCome back to the worksheet of “Bubble Chart”, and then click the Tooltip button. Click Insert and then add the chart in worksheet “Trade Value” as Figure 25. When we put the cursor in a bubble, we will see the Tooptip shown as Figure26.\r\nFigure 25 Figure 26\r\nCreate a new worksheet and then rename it as “Value Comparison”. Drag the variables as Figure 27. Change the title as “Comparison of Imports and Exports among Regions, ” by using title edit.\r\nFigure 27\r\nCreate a dashboard and rename it as “Merchandise Trade”. Drag and adjust the worksheet as Figure 28. Add the main title of “Merchandise Trade Change and Comparison of Trading Partners, 2011-2020”, and add the note.\r\nFigure 28\r\nRight click in the area of Region filter, and then check “All Using Related Data Sources”.\r\nFigure 29\r\nThe whole chart will change when checking different regions and different years.\r\nFigure 30\r\n4.4 Final Visualisation\r\nThe snapshot of dashboard is shown in the following and then rename the dashboard to “Merchandise Trade”.\r\nFigure 31\r\n5. Main Observations\r\n1) The change of trade roles within the given period: Based on the change track of bubbles shown in the visualisation, we can know that the trade roles of most trading partners did not change during the study period, which means that most trading partners kept the roles of net exporters or net importers in this 10 years. However, there are still some changes of trade roles for some trading partners. For example, United State changed from net importers to net exporters from 2019 to 2020 while Malaysia changed from net exporters to net importers from 2018 to 2019.\r\nFigure 32\r\nFigure 33\r\n2) Imbalance merchandise trade value among trading partners: The position and size of bubbles show that most of the trading partners show relatively small trade values, and they are clustered in the lower left corner of the picture. The top 10 trading partners do far more trade than most other countries, both in terms of exports and imports. These large trading partners tend to be more developed or more populous economies.\r\nFigure 34\r\n3) Hong Kong and Taiwan are special trading partners for Singapore: During the given 10 years, the positions of most trading partners, especially the large trading partners, were closed to the diagonal reference line, which means that the difference between exports and imports is not so large for most trading partners. However, the positions of Hong Kong and Taiwan are far from the diagonal reference line. This means that Hong Kong is a net exporters with relative larger trade surplus value while Taiwan is a net importers with relative relative larger trade deficit value.\r\nFigure 35\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-21T16:18:29+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-05-30-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "This post is built for DataViz Makeover 1 of ISSS608 Visual Analytics and    Application.",
    "author": [
      {
        "name": "LI Yuhong",
        "url": {}
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n1.1 Data Source\r\n1.2 The Original Visualisation\r\n\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\n3.2 Advantages of Proposed Design\r\n\r\n4. Data Visualisation Steps\r\n4.1 Data Preparation\r\n4.2 Import and Pivot Data\r\n4.3 Data Visualisation\r\n4.4 Final Visualisation\r\n\r\n5. Main Observations\r\n\r\n1. Introduction\r\n1.1 Data Source\r\nThe data visualisations, including the original one and the redesigned one, were created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market and are compiled by the Enterprise Singapore.\r\n1.2 The Original Visualisation\r\nThe original data visualisation that will be assessed was shown in the following figure. This visualization shows the merchandise trade, including export and import, between Singapore and top six trading countries during the period from 2019 to 2020. Based on this visualisation, we should not only compare the quantity of merchandise trade among these six countries, but also compare the difference between export and import in each graph.\r\nFigure 1\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nChart title is not precise: The title “Merchandise Trade of Top Six Trading Countries, 2019-2020” does not derive the explicit information of the merchandise trade, which means that we cannot know the merchandise trade is the quantity of export and import between Singapore and other six countries.\r\nChange the title to “Singapore’s Merchandise Trade (Export, Import and Trade Balance) of Top Six Trading Countries, 2019-2020”.\r\n2\r\nThere are not clear notes for the chart”: The necessary notes were lost, so we cannot know the currency unit and data source of this chart.\r\nAdd clear notes to describe necessary concepts and information.\r\n3\r\nX axis title and tick marks were not properly labeled: The title of x axis is “Month of Period”, but the tick marks show the years which don’t match the title properly.\r\nChange the title of x axis to “Time”.\r\n4\r\nDifferent ranges of y axis for import and export makes the comparison difficult: Within the graph for a country, it is difficult for readers to compare the import and export based on different ranges, which means that readers cannot know whether export is larger than import or not intuitively. At the same time, due to the different ranges of y axis among different graphs, we cannot compare the trade volume among countries directly.\r\nFix all the ranges of y axis consistent.\r\n5\r\nThe lack of labels in x axis: In the graph of Japan, there are not labels for the year of 2019 and 2021 in x axis.\r\nAdd the lacking labels in x axis.\r\n6\r\nUnclear aim of the chart: There is not a very clear goal to show in this chart, which means that the reader does not know whether the graph is comparing imports and exports of each country or among countries.\r\nShow clear aim in the chart title or choose proper chart type.\r\n7\r\nThe lack of unit: There is not a unit note or label of the values.\r\nAdd a unit note or label.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n8\r\nThe title’s font size: The font size of chart title is not so large compared with other characters in the chart, so the readers cannot realize the title easily. It will be more reasonable to make the title’s font size bigger.\r\nMake the title’s font size bigger.\r\n9\r\nThe width of each graph is not the same: The six graphs for each country showed the same period from 2019 to 2020, but the width is not the same in each graph. The uneven width can be confusing to the readers.\r\nFix the width of each graph consistent.\r\n10\r\nThe inappropriate chart type: The overlap of import area and export area makes the graphs confusing and messy. It is difficult for readers to follow the edges of export or import area within the part of overlap, so readers cannot get information quickly and clearly. And the dark color of overlap areas makes the graphs messy.\r\nAdjust the color of overlap area and change the graphs to line charts.\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\nFigure 2\r\n3.2 Advantages of Proposed Design\r\nClear title: shows Singapore’s merchandise trade of Top Six Trading Countries in the period from 2019 to 2020.\r\nShort and clear note: figures out the, data source, currency unit and definition of “Trade Balance”.\r\nAxis are properly labeled: shows the clear axis labels and consistent tick marks. Consistent tick marks are convenient for readers to compare among countries intuitively.\r\nMore suitable chart types: the line charts are used to show the changes of export and import in the given period. At the same time, this line graph shows a third line of trade balance which is an important value in researching merchandise trade.\r\nColors: are consistent, clear and suitable.\r\n4. Data Visualisation Steps\r\n4.1 Data Preparation\r\nDelete unnecessary worksheet and rename worksheets: Delete the “Content” worksheet and rename “T1” and “T2” to “Import” and “Export” respectively.\r\nFigure 3\r\nFigure 4\r\nRemove unnecessary columns: Only the data from 2019 to 2020 will be used, so the columns of other years should be removed from the worksheets of Import and Export.\r\nFigure 5\r\nRemove unnecessary rows: Only the data of Hong Kong, Mainland China, Japan, Malaysia, Taiwan and US will be used, so the introduction of the dataset and the data of other countries should be removed from the worksheets of Import and Export.\r\nFigure 6\r\nTranspose the data: The time is shown in the first row while the countries are shown in the first column, but we need to exchange the place of time and countries. Select and copy the area of dataset, and then right click in empty space to choose Transpose under the function of Paste Option. After pasting the data, the original data should be deleted and the dataset is shown as following. Complete this step in two worksheets.\r\nFighre 7\r\nRename the headers: Change the headers of “Variables” to “Date” and complete similar step in the worksheet of Export.\r\nFighre 8\r\nFigure 9\r\nCreate new worksheets for each country: Create a new worksheet called “Malaysia”, and then copy the date, Malaysia’ Import column and Malaysia’ Export column in this new worksheet. Add a new column of “Trade Balance” and then calculate the value of it by “Export”-“Import”. Using the similar steps, the new worksheets for other countries were created.\r\nFigure 10\r\nSave and rename the Excel file: Change the File name of Excel to “Merchandise Trade” and then save it.\r\nFigure 11\r\n4.2 Import and Pivot Data\r\nImport the file of “Merchandise Trade” into Tableau. And then drag the table “Hong Kong” into table area.\r\nFigure 12\r\nCombine all the other countries based on “Date”.\r\nFigure 13\r\nSelect the columns of “Import”, “Export” and “Trade Balance” and then right click to pivot these data. Change the data type of column “Date” to Date, and change the data type of column “Pivot Field Values” to *Number(whole).\r\nFigure 14\r\nChange the name of “Pivot Field Names” to “Type” and change the name of “Pivot Field Values” to “Value”.\r\nFigure 15\r\nRepeat the steps above in the tables of other countries.\r\n4.3 Data Visualisation\r\nChange the name of sheet 1 and the title to “Hong Kong”. In this sheet, drag “Date (Hong Kong)” and “Value (Hong Kong)” into Columns and Rows respectively. Change the data type of “Date” to Month. And then drag “Type” to Colour under the function card of Marks. The line chart will be created as the following figure.\r\nFigure 16\r\nSetting the same range of y axis is convenient for comparing among different graphs. After observing the range of all the charts, we knew that the range of y axis that suits all charts is from -3,000,000 to 8,000,000, so we should change the range of y axis in these six graphs. Edit Axis as the following figure.\r\nFigure 17\r\nAdd a reference line at the constant value of 0, and then adjust the reference line as the following figure in all the six graphs. The reference line can help readers to figure out whether the result of trade balance is surplus or deficit.\r\nFigure 18\r\nBased on the original dataset, we knew that the currency used to measure is US dollar, so we should apply currency of US dollar in the units of graphs. Edit the units of “Value” by the steps shown in following figures and do the same steps for all graphs.\r\nFigure 19\r\nFigure 20\r\nBy using the same manipulation in the sheet of “Hong Kong”, the worksheets of other countries were built.\r\nFigure 21\r\n4.4 Final Visualisation\r\nAfter building a new dashboard, add all the six graphs in it and adjust the position of graphs. Click “Show dashboard title”, and then edit the tile to “Singapore’s Merchandise Trade (Export, Import and Trade Balance) of Top Six Trading Countries, 2019-2020”. Adjust the position and the font size for the title and subtitles.\r\nFigure 22\r\nEdit board for each sub-graph.\r\nFigure 23\r\nDelete redundant legends and rename the legend as the following.\r\nFigure 24\r\nThe snapshot of dashboard is shown in the following and then rename the dashboard to “Merchandise Trade”.\r\nFigure 25\r\n5. Main Observations\r\n1) Trade Scale of Import and Export\r\nWithin these six counties, Singapore had larger export value with Hong Kong, Mainland China, Malaysia and United State, while had relatively lower export value with Japan and Taiwan. Import values showed that Singapore had larger import value with Mainland China, Malaysia, Taiwan and United State, but had smaller value with Japan and Hong Kong. Totally, Japan had the smallest scale of trade with Singapore due to the lower value of both import and export.\r\n2) Fluctuation\r\nChina and the United States had larger fluctuations in all the three values (import, export and trade balance) than other countries. There were some fluctuations in Hong Kong but the values kept totally stable. Japan and Taiwan showed pretty flat fluctuations during the given period. There seemed a significant decline in Hong Kong’ import and export, Mainland China’s import and export, Malaysia’ import and export, United State’ import at the similar period of the beginning of 2020. For the trade between Singapore and Malaysia, there was an obvious decline in the values of import and export at the beginning of 2020, and after that trade balance kept in negative value (trade deficit).\r\n3) Trade Balance\r\nMost countries showed relatively approximate values of import and export, but there was a pretty difference between export value and import value for Taiwan, especially Hong Kong. Based on the chart, we can know that Hong Kong showed the largest scale of trade surplus (the highest positive value in trade balance) and Taiwan showed the scale of trade deficit (the lowest negative value in trade balance) in the international trade with Singapore.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-16T17:02:27+08:00",
    "input_file": {}
  }
]
