[
  {
    "path": "posts/2021-05-30-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nThis post is built for DataViz Makeover 1 of ISSS608 Visual Analytics and Application.\r\n1.1 Data Source\r\nThe data visualisations, including the original one and the redesigned one, were created by using data provided by Department of Statistics, Singapore (DOS). The data are available under the sub-section of Merchandise Trade by Region/Market and are compiled by the Enterprise Singapore.\r\n1.2 The Original Visualisation\r\nThe original data visualisation that will be assessed was shown in Figure 1. This visualization shows the merchandise trade, including export and import, between Singapore and top six trading countries during the period from 2019 to 2020. Based on this visualisation, we should not only compare the quantity of merchandise trade among these six countries, but also compare the difference between export and import in each graph.\r\n\r\n2. Critiques and Suggestions\r\n2.1 Clarity\r\nS/N\r\nCritiques\r\nComments\r\n1\r\nChart title is not precise: The title “Merchandise Trade of Top Six Trading Countries, 2019-2020” does not derive the explicit information of the merchandise trade, which means that we cannot know the merchandise trade is the quantity of export and import between Singapore and other six countries.\r\nChange the title to “Singapore’s Merchandise Trade (Export, Import and Trade Balance) of Top Six Trading Countries, 2019-2020”.\r\n2\r\nThere are not clear notes for the chart”: The necessary notes were lost, so we cannot know the currency unit and data source of this chart.\r\nAdd clear notes to describe necessary concepts and information.\r\n3\r\nX axis title and tick marks were not properly labeled: The title of x axis is “Month of Period”, but the tick marks show the years which don’t match the title properly.\r\nChange the title of x axis to “Time”.\r\n4\r\nDifferent ranges of y axis for import and export makes the comparison difficult: Within the graph for a country, it is difficult for readers to compare the import and export based on different ranges, which means that readers cannot know whether export is larger than import or not intuitively. At the same time, due to the different ranges of y axis among different graphs, we cannot compare the trade volume among countries directly.\r\nFix all the ranges of y axis consistent.\r\n5\r\nThe lack of labels in x axis: In the graph of Japan, there are not labels for the year of 2019 and 2021 in x axis.\r\nAdd the lacking labels in x axis.\r\n6\r\nUnclear aim of the chart: There is not a very clear goal to show in this chart, which means that the reader does not know whether the graph is comparing imports and exports of each country or among countries.\r\nShow clear aim in the chart title or choose proper chart type.\r\n7\r\nThe lack of unit: There is not a unit note or label of the values.\r\nAdd a unit note or label.\r\n2.2 Aesthetics\r\nS/N\r\nCritiques\r\nComments\r\n8\r\nThe title’s font size: The font size of chart title is not so large compared with other characters in the chart, so the readers cannot realize the title easily. It will be more reasonable to make the title’s font size bigger.\r\nMake the title’s font size bigger.\r\n9\r\nThe width of each graph is not the same: The six graphs for each country showed the same period from 2019 to 2020, but the width is not the same in each graph. The uneven width can be confusing to the readers.\r\nFix the width of each graph consistent.\r\n10\r\nThe inappropriate chart type: The overlap of import area and export area makes the graphs confusing and messy. It is difficult for readers to follow the edges of export or import area within the part of overlap, so readers cannot get information quickly and clearly. And the dark color of overlap areas makes the graphs messy.\r\nAdjust the color of overlap area and change the graphs to line charts.\r\n3. Proposed Visualisation\r\n3.1 Sketch\r\n\r\n3.2 Advantages of Proposed Design\r\nClear title: shows Singapore’s merchandise trade of Top Six Trading Countries in the period from 2019 to 2020.\r\nShort and clear note: figures out the, data source, currency unit and definition of “Trade Balance”.\r\nAxis are properly labeled: shows the clear axis labels and consistent tick marks. Consistent tick marks are convenient for readers to compare among countries intuitively.\r\nMore suitable chart types: the line charts are used to show the changes of export and import in the given period. At the same time, this line graph shows a third line of trade balance which is an important value in researching merchandise trade.\r\nColors: are consistent, clear and suitable.\r\n4. Data Visualisation Steps\r\n4.1 Data Preparation\r\nDelete unnecessary worksheet and rename worksheets: Delete the “Content” worksheet and rename “T1” and “T2” to “Import” and “Export” respectively.\r\n\r\nRemove unnecessary columns: Only the data from 2019 to 2020 will be used, so the columns of other years should be removed from the worksheets of Import and Export.\r\n\r\nRemove unnecessary rows: Only the data of Hong Kong, Mainland China, Japan, Malaysia, Taiwan and US will be used, so the introduction of the dataset and the data of other countries should be removed from the worksheets of Import and Export.\r\n\r\nTranspose the data: The time is shown in the first row while the countries are shown in the first column, but we need to exchange the place of time and countries. Select and copy the area of dataset, and then right click in empty space to choose Transpose under the function of Paste Option. After pasting the data, the original data should be deleted and the dataset is shown as following. Complete this step in two worksheets.\r\n\r\nRename the headers: Change the headers of “Variables” to “Date” and complete similar step in the worksheet of Export.\r\n\r\nCreate new worksheets for each country: Create a new worksheet called “Malaysia”, and then copy the date, Malaysia’ Import column and Malaysia’ Export column in this new worksheet. Add a new column of “Trade Balance” and then calculate the value of it by “Export”-“Import”. Using the similar steps, the new worksheets for other countries were created.\r\n\r\nSave and rename the Excel file: Change the File name of Excel to “Merchandise Trade” and then save it.\r\n\r\n4.2 Import and Pivot Data\r\nImport the file of “Merchandise Trade” into Tableau. And then drag the table “Hong Kong” into table area.\r\n\r\nCombine all the other countries based on “Date”.\r\n\r\nSelect the columns of “Import”, “Export” and “Trade Balance” and then right click to pivot these data. Change the data type of column “Date” to Date, and change the data type of column “Pivot Field Values” to *Number(whole).\r\n\r\nChange the name of “Pivot Field Names” to “Type” and change the name of “Pivot Field Values” to “Value”.\r\n\r\nRepeat the steps above in the tables of other countries.\r\n4.3 Data Visualisation\r\nChange the name of sheet 1 and the title to “Hong Kong”. In this sheet, drag “Date (Hong Kong)” and “Value (Hong Kong)” into Columns and Rows respectively. Change the data type of “Date” to Month. And then drag “Type” to Colour under the function card of Marks. The line chart will be created as the following figure.\r\n\r\nSetting the same range of y axis is convenient for comparing among different graphs. After observing the range of all the charts, we knew that the range of y axis that suits all charts is from -3,000,000 to 8,000,000, so we should change the range of y axis in these six graphs. Edit Axis as the following figure.\r\n\r\nAdd a reference line at the constant value of 0, and then adjust the reference line as the following figure in all the six graphs. The reference line can help readers to figure out whether the result of trade balance is surplus or deficit.\r\n\r\nBased on the original dataset, we knew that the currency used to measure is US dollar, so we should apply currency of US dollar in the units of graphs. Edit the units of “Value” by the steps shown in following figures and do the same steps for all graphs.\r\n\r\nBy using the same manipulation in the sheet of “Hong Kong”, the worksheets of other countries were built.\r\n\r\n4.4 Final Visualisation\r\nAfter building a new dashboard, add all the six graphs in it and adjust the position of graphs. Click “Show dashboard title”, and then edit the tile to “Singapore’s Merchandise Trade (Export, Import and Trade Balance) of Top Six Trading Countries, 2019-2020”. Adjust the position and the font size for the title and subtitles.\r\n\r\nEdit board for each sub-graph.\r\n\r\nDelete redundant legends and rename the legend as the following.\r\n\r\nThe snapshot of dashboard is shown in the following and then rename the dashboard to “Merchandise Trade”.\r\n\r\n5. Main Observations\r\n1) Trade Scale of Import and Export\r\nWithin these six counties, Singapore had larger export value with Hong Kong, Mainland China, Malaysia and United State, while had relatively lower export value with Japan and Taiwan. Import values showed that Singapore had larger import value with Mainland China, Malaysia, Taiwan and United State, but had smaller value with Japan and Hong Kong. Totally, Japan had the smallest scale of trade with Singapore due to the lower value of both import and export.\r\n2) Fluctuation\r\nChina and the United States had larger fluctuations in all the three values (import, export and trade balance) than other countries. There were some fluctuations in Hong Kong but the values kept totally stable. Japan and Taiwan showed pretty flat fluctuations during the given period. There seemed a significant decline in Hong Kong’ import and export, Mainland China’s import and export, Malaysia’ import and export, United State’ import at the similar period of the beginning of 2020. For the trade between Singapore and Malaysia, there was an obvious decline in the values of import and export at the beginning of 2020, and after that trade balance kept in negative value (trade deficit).\r\n3) Trade Balance\r\nMost countries showed relatively approximate values of import and export, but there was a pretty difference between export value and import value for Taiwan, especially Hong Kong. Based on the chart, we can know that Hong Kong showed the largest scale of trade surplus (the highest positive value in trade balance) and Taiwan showed the scale of trade deficit (the lowest negative value in trade balance) in the international trade with Singapore.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T21:49:38+08:00",
    "input_file": "dataviz-makeover-1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to My Blog",
    "description": "Welcome to our new blog, My Blog. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-05-21",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-21T22:40:19+08:00",
    "input_file": {}
  }
]
